src/InformationRegisters/СоответствиеДокументовМФП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеДокументовМФП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РеализацияВозвратПоставщику</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоступлениеВозвратОтПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СоответствиеДокументовМФП/Ext/ManagerModule.bsl
Процедура ОчиститьСоответствие(Документ) Экспорт
	
	лКлючАлгоритма = "РегистрСведений_СоответствиеДокументовМФП_МодульМенеджера_ОчиститьСоответствие";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		НЗ = РегистрыСведений.СоответствиеДокументовМФП.СоздатьНаборЗаписей();
		НЗ.Отбор.ПоступлениеВозвратОтПокупателя.Установить(Документ);
		НЗ.Записать();
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		НЗ = РегистрыСведений.СоответствиеДокументовМФП.СоздатьНаборЗаписей();
		НЗ.Отбор.РеализацияВозвратПоставщику.Установить(Документ);
		НЗ.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьСоответствие(Документ1, Документ2) Экспорт
	
	лКлючАлгоритма = "РегистрСведений_СоответствиеДокументовМФП_МодульМенеджера_УстановитьСоответствие";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		Выполнить(лЗамена);
		Возврат;
	КонецЕсли;
	///////////////////////////////////////////////////////////////////////////
	
	ПоступлениеВозвратОтПокупателя 	= Неопределено;
	РеализацияВозвратПоставщику		= Неопределено;
	
	Если ТипЗнч(Документ1) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗнч(Документ1) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ПоступлениеВозвратОтПокупателя = Документ1;
	ИначеЕсли ТипЗнч(Документ1) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		ИЛИ ТипЗнч(Документ1) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		РеализацияВозвратПоставщику = Документ1;
	КонецЕсли;
	
	Если ТипЗнч(Документ2) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗнч(Документ2) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ПоступлениеВозвратОтПокупателя = Документ2;
	ИначеЕсли ТипЗнч(Документ2) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		ИЛИ ТипЗнч(Документ2) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		РеализацияВозвратПоставщику = Документ2;
	КонецЕсли;
	
	ОчиститьСоответствие(ПоступлениеВозвратОтПокупателя);
	ОчиститьСоответствие(РеализацияВозвратПоставщику);
	
	МЗ = РегистрыСведений.СоответствиеДокументовМФП.СоздатьМенеджерЗаписи();
	МЗ.РеализацияВозвратПоставщику = РеализацияВозвратПоставщику;
	МЗ.ПоступлениеВозвратОтПокупателя = ПоступлениеВозвратОтПокупателя;
	
	Если НЕ ЗначениеЗаполнено(МЗ.РеализацияВозвратПоставщику)
		ИЛИ  НЕ ЗначениеЗаполнено(МЗ.ПоступлениеВозвратОтПокупателя) Тогда
		ВызватьИсключение "Ошибка установки соответствия мфп для документов: "+Документ1+", "+Документ2;		
	КонецЕсли;              
	
	МЗ.Записать();
	
КонецПроцедуры

Функция ПолучитьДокументПоСоответствию(Документ) Экспорт
	
	лКлючАлгоритма = "РегистрСведений_СоответствиеДокументовМФП_МодульМенеджера_ПолучитьДокументПоСоответствию";
	лЗамена =  АлгоритмыПолучитьЗамену(лКлючАлгоритма);
	Если Не лЗамена = Неопределено Тогда
		АлгоритмыЗначениеВозврата = Неопределено;		
		Выполнить(лЗамена);		
		Возврат АлгоритмыЗначениеВозврата;		
	КонецЕсли;	
	///////////////////////////////////////////////////////////////////////////
	
	ПолеУсловия = "";
	ПолеВыбора = "";
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
		ПолеУсловия = "ПоступлениеВозвратОтПокупателя";
		ПолеВыбора 	= "РеализацияВозвратПоставщику";
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратТоваровПоставщику")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ПолеУсловия = "РеализацияВозвратПоставщику";
		ПолеВыбора 	= "ПоступлениеВозвратОтПокупателя";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПолеУсловия) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать &ПолеВыбора КАК Ссылка ИЗ РегистрСведений.СоответствиеДокументовМФП ГДЕ &ПолеУсловия = &Документ";
	Запрос.УстановитьПараметр("Документ", Документ);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеВыбора", ПолеВыбора);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ПолеУсловия", ПолеУсловия);
	ТаблицаРезультата = Запрос.Выполнить().Выгрузить();
	
	ВозвращаемоеЗначение = Неопределено;
	Если ТаблицаРезультата.Количество() > 0 Тогда
		ВозвращаемоеЗначение = ТаблицаРезультата[0].Ссылка;
	КонецЕсли;
	
	Возврат ВозвращаемоеЗначение;
	       	
КонецФункции
